# BendDiameterTooSmall Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..BendDiameterTooSmall Property
BuiltInFailures..::..RebarFailures Class See Also
---
Rebar Bend Diameter is too small.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId BendDiameterTooSmall { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BendDiameterTooSmall As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ BendDiameterTooSmall {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace